#include <iostream> 
using namespace std;

float calculate_salary(float sales) // Функция для расчета зарплаты менеджера
{
  float percent = 0; // Процент от продаж

  if (sales < 500) // Если продажи меньше 500
  {
    percent = 0.03; // 3% от продаж
  }
  else if (sales < 1000) // Если продажи от 500 до 999
  {
    percent = 0.05; // 5% от продаж
  }
  else // Если продажи 1000 и больше
  {
    percent = 0.08; // 8% от продаж
  }

  return 200 + sales * percent; // Базовая зарплата 200$ + процент от продаж
}

int main()
{
  float sales[3];  // Массив для хранения продаж трех менеджеров
  float salary[3]; // Массив для хранения зарплаты трех менеджеров

  cout << "\nВведите уровень продаж для 3 менеджеров:\n"; // Просим пользователя ввести продажи
  for (int i = 0; i < 3; i++)                             // Цикл по всем менеджерам
  {
    cout << "Менеджер " << i + 1 << ": ";   // Подсказка, какой менеджер
    cin >> sales[i];                        // Ввод продаж
    salary[i] = calculate_salary(sales[i]); // Рассчитываем зарплату через функцию
  }

  int best_index = 0;         // Индекс лучшего менеджера
  for (int i = 1; i < 3; i++) // Ищем менеджера с максимальными продажами
  {
    if (sales[i] > sales[best_index]) // Если текущий менеджер продал больше
    {
      best_index = i; // Сохраняем индекс
    }
  }

  salary[best_index] += 200; // Начисляем премию лучшему менеджеру

  cout << "-----------------------"; // Разделитель в выводе

  cout << "\nРезультаты:\n";  // Заголовок для итогов
  for (int i = 0; i < 3; i++) // Проходим по всем менеджерам
  {
    cout << "Менеджер " << i + 1 << ": Продажи = " << sales[i] << "$, Зарплата = " << salary[i] << "$"; // Вывод результатов
    if (i == best_index)                                                                                // Если это лучший менеджер
    {
      cout << " (+премия)"; // Отмечаем премию
    }
    cout << endl; // Переход на новую строку
  }

  cout << "\nЛучший менеджер: №" << best_index + 1 << endl; // Выводим номер лучшего менеджера

  return 0; // Завершение программы
}
