#include <iostream> 
#include <cctype>   
using namespace std;

int main()
{
  char ch; // Переменная для хранения введённого символа

  cout << "Введите символ: "; // Просим пользователя ввести символ
  cin >> ch;                  // Ввод символа

  if (isalpha(ch)) // Проверяем, является ли символ буквой
  {
    cout << "Это буква." << endl; // Если да — выводим сообщение
  }
  else if (isdigit(ch)) // Проверяем, является ли символ цифрой
  {
    cout << "Это цифра." << endl; // Если да — выводим сообщение
  }
  else if (ispunct(ch)) // Проверяем, является ли символ знаком препинания
  {
    cout << "Это знак препинания." << endl; // Если да — выводим сообщение
  }
  else // Если символ не буква, не цифра и не знак препинания
  {
    cout << "Это другой символ." << endl; // Выводим сообщение о прочем символе
  }

  return 0; // Завершение программы
}
