#include <iostream>
#include <vector>
#include <string>
using namespace std;

int main()
{
  const int days = 7;    // количество дней в неделе
  double expenses[days]; // Массив для хранения расходов за каждый день
  string dayNames[days] = {
      "Понедельник", "Вторник", "Среда", "Четверг",
      "Пятница", "Суббота", "Воскресенье"};
  // Массив с названиями дней недели по порядку
  cout << "Введите расходы за каждый день недели (в долларах):\n";
  for (int i = 0; i < days; i++) // Цикл для ввода расходов за все 7 дней
  {
    cout << dayNames[i] << ": "; // Выводим название текущего дня
    cin >> expenses[i];          // Считываем сумму расходов за этот день
  }

  double total = 0.0;            // Переменная для хранения общей суммы расходов
  for (int i = 0; i < days; i++) // Цикл для вычисления общей суммы
  {
    total += expenses[i]; // Добавляем расходы текущего дня к общей сумме
  }

  double average = total / days; // Вычисляем среднее значение расходов за неделю

  vector<string> expensivedays; // Вектор для хранения названий дней, когда расходы > 100
  int countExpensive = 0;       // Счётчик дней с расходами больше 100 долларов

  for (int i = 0; i < days; i++) // Проходим по всем дням недели
  {
    if (expenses[i] > 100.0) // Проверяем, превышают ли расходы 100 долларов
    {
      expensivedays.push_back(dayNames[i]); // Добавляем название дня в список дорогих дней
      countExpensive++;                     // Увеличиваем счётчик таких дней
    }
  }

  cout << "\nРезультаты анализа\n";
  cout << "Общая сумма расходов за неделю: $" << total << "\n";             // Вывод общей суммы
  cout << "Средняя сумма расходов в день: $" << average << "\n";            // Вывод среднего значения
  cout << "Количество дней с расходами > $100: " << countExpensive << "\n"; // Вывод количества дорогих дней

  if (countExpensive > 0) // Если есть хоть один дорогой день
  {
    cout << "Дни, когда расходы превысили $100:\n";
    for (const string &day : expensivedays) // Проходим по всем записанным дорогим дням
    {
      cout << "- " << day << "\n"; // Выводим название дня
    }
  }
  else
  {
    cout << "Ни в один день расходы не превысили $100.\n"; // Сообщение, если дорогих дней нет
  }

  return 0;
}