#include <iostream>
#include <cstdlib>
#include <ctime>
using namespace std;

int main()
{
  int size = 10; // Задаём размер массивов — 10 элементов
  int arr1[size];      // Объявляем первый массив
  int arr2[size];      // Объявляем второй массив
  int sumArr[size];    // Объявляем третий массив для хранения сумм

  srand(time(nullptr)); // Инициализируем генератор случайных чисел текущим временем

  cout << "Первый массив: ";     // Выводим заголовок для первого массива
  for (int i = 0; i < size; i++) // Цикл для заполнения и вывода первого массива
  {
    arr1[i] = rand() % 101 - 50; // Генерируем случайное число в диапазоне [-50, 50]
    cout << arr1[i] << " ";      // Выводим текущий элемент первого массива
  }
  cout << "\n"; // Переход на новую строку

  cout << "Второй массив: ";     // Выводим заголовок для второго массива
  for (int i = 0; i < size; i++) // Цикл для заполнения и вывода второго массива
  {
    arr2[i] = rand() % 101 - 50; // Генерируем случайное число в том же диапазоне [-50, 50]
    cout << arr2[i] << " ";      // Выводим текущий элемент второго массива
  }
  cout << "\n"; // Переход на новую строку

  cout << "Сумма массивов: ";    // Выводим заголовок для результирующего массива
  for (int i = 0; i < size; i++) // Цикл для поэлементного сложения и вывода
  {
    sumArr[i] = arr1[i] + arr2[i]; // Складываем соответствующие элементы и сохраняем в sumArr
    cout << sumArr[i] << " ";      // Выводим текущий элемент результирующего массива
  }
  cout << "\n"; // Завершаем вывод результата

  return 0;
}