#include <iostream> 
using namespace std;

int main()
{
  int num, num1, num2, num3, num4; // Переменные: число и его преобразованные части
  cout << "Введите число: ";       // Просим пользователя ввести число
  cin >> num;                      // Ввод числа

  if (num < 1000 || num > 9999) // Проверка: является ли число четырёхзначным
  {
    cout << "Число НЕ четырехзначное" << endl; // Если нет — выводим ошибку
    return 1;                                  // Завершаем программу
  }

  num1 = num / 1000 * 100;      // Первая цифра → смещаем на сотни
  num2 = num / 100 % 10 * 1000; // Вторая цифра → переносим в тысячи
  num3 = num / 10 % 10;         // Третья цифра → остаётся на месте
  num4 = num % 10 * 10;         // Четвёртая цифра → переносим в десятки

  num = num1 + num2 + num3 + num4; // Формируем новое число
  cout << num << endl;             // Вывод результата

  return 0; // Завершение программы
}
