#include <iostream>
using namespace std;

int main()
{
  int num, num1, num2, num3, sum1, num4, num5, num6, sum2; // Объявляем переменные для числа и цифр

  cout << "Введи шестизначное число, чтобы узнать счастливое оно или нет: "; // Просим ввести число
  cin >> num;                                                                // Ввод числа

  if (num < 100000 || num > 999999) // Проверка: число должно быть шестизначным
  {
    cout << "Число НЕ шестизначное" << endl; // Если нет — выводим сообщение
    return 1;                                // Завершаем программу
  }

  num1 = num / 100000;     // Первая цифра числа
  num2 = num / 10000 % 10; // Вторая цифра числа
  num3 = num / 1000 % 10;  // Третья цифра числа
  num4 = num / 100 % 10;   // Четвёртая цифра числа
  num5 = num / 10 % 10;    // Пятая цифра числа
  num6 = num % 10;         // Шестая цифра числа

  sum1 = num1 + num2 + num3; // Сумма первых трёх цифр
  sum2 = num4 + num5 + num6; // Сумма последних трёх цифр

  if (sum1 == sum2) // Сравниваем суммы
  {
    cout << "Число " << num << " счастливое" << endl; // Если равны — число счастливое
  }
  else
  {
    cout << "Число " << num << " НЕ счастливое" << endl; // Если нет — не счастливое
  }

  return 0; // Завершаем программу
}
